import React from 'react';
import { Metadata } from 'next';
import Header from '../../../components/common/header/Header';
import styles from '../styles.module.scss';
import Footer from '../../../components/common/footers/footer/Footer';

const site = 'https://uppr.com.ua';

export const metadata: Metadata = {
  title: 'UPPR | Договір публічної оферти',
  description: 'UPPR Ресурс про англійську мову та як писати email.Договір публічної оферти',
  keywords: 'education on-line, english, business, writing, skills, emails',
  icons: {
    icon: '/favicon.png',
    apple: '/favicon.png',
    shortcut: '/favicon.png',
  },
  other: {
    'google-site-verification': '8Ui50OggqnZ5J1RPshJXelSAYWMPvFGWv32MSzHHlJU',
  },
};

export default function PublicOfferPage() {
  return (
    <div className={styles.upprPage}>
      <Header search location={'/public/public-offer'} />
      <div className={`uppr-page-content ${styles.upprPageContent}`}>
        <div className={styles.upprPublicOfferPage}>
          <h1>Договір публічної оферти</h1>

          <ol>
            <li>
              <h2>ЗАГАЛЬНІ ПОЛОЖЕННЯ</h2>
              <ol>
                <li>
                  Даний публічний договір (далі - Оферта, договір) являє собою офіційну пропозицію «Виконавця» на
                  сайті <a href={site}>{site}</a>, з надання інформаційних послуг юридичним та/або фізичним особам
                  (далі - Замовник) на перерахованих нижче умовах, шляхом надання інформації через спеціальної форми
                  передачі інформації, спрямованої на придбання Замовником додаткових знань, умінь і навичок у певній
                  сфері діяльності за встановлену плату.
                </li>
                <li>
                  Прийняття (акцепт) даної Оферти означає повне і беззастережне прийняття Замовником всіх умов без
                  будь-яких винятків і/або обмежень, і прирівнюється відповідно до ч. 2 ст. 642 Цивільного кодексу
                  України (далі - ЦК України) до заключення сторонами двостороннього письмового договору на умовах,
                  які викладені нижче в цій Оферті.
                </li>
                <li>
                  Даний публічний договір про надання інформаційних послуг (Оферта) вважається укладеним
                  (акцептованим) з моменту надходження грошових коштів Замовника на розрахунковий рахунок Виконавця.
                </li>
                <li>
                  Виконавець і Замовник надають взаємні гарантії своєї право- та дієздатності необхідні для укладення
                  та виконання цього Договору про надання Інформаційних послуг.
                </li>
              </ol>
            </li>
            <li>
              <h2>ВИЗНАЧЕННЯ І ТЕРМІНИ</h2>
              <ol>
                <li>
                  В цій Оферті нижченаведені терміни вживаються в такому значенні:
                  <p>
                    <b>Оферта</b> - даний публічний договір про надання інформаційних послуг.
                  </p>
                  <p>
                    <b>Сайт</b> - інтернет-сайт <a href={site}>{site}</a>, який використовуваний Виконавцем на правах
                    власності.
                  </p>
                  <p>
                    <b>Інформаційні послуги</b> – послуги Виконавця, види і вартість яких визначена на Сайті, з
                    надання інформації через спеціальної форми передачі інформації, спрямованої на придбання
                    Замовником додаткових знань, умінь і навичок у певній сфері діяльності.
                  </p>
                  <p>
                    <b>Акцепт оферти</b> - повне і беззастережне прийняття оферти шляхом 100% попередньої оплати
                    Інформаційної послуги.
                  </p>
                  <p>
                    <b>Виконавець</b> - Табачук Іванна Вікторівна.
                  </p>
                  <p>
                    <b>Замовник</b> - особа, яка здійснила Акцепт оферти на викладених в ній умовах.
                  </p>
                  <p>
                    <b>Договір про надання інформаційних послуг (далі - Договір)</b> - договір між Замовником та
                    Виконавцем про надання Інформаційних послуг, який укладається шляхом Акцепту цієї Оферти.
                  </p>
                </li>
              </ol>
            </li>
            <li>
              <h2>ПРЕДМЕТ ОФЕРТИ</h2>
              <ol>
                <li>
                  Предметом даної Оферти є платне надання Інформаційних послуг Замовнику силами Виконавця відповідно
                  до умов цієї Оферти шляхом надання Замовнику Інформаційних послуг за оплату.
                </li>
                <li>
                  Вартість кожного виду Інформаційної послуги встановлюється на Сайті Виконавця. Даний договір про
                  надання інформаційних послуг вважається укладеним з моменту надходження грошових коштів на
                  розрахунковий рахунок Виконавця.
                </li>
                <li>
                  Платежі за цим договором здійснюються одним із способів запропонованих Замовнику, в тому числі при
                  натисканні кнопки «Купити»(«Buy»), які включають в себе:
                  <ul>
                    <li>оплата електронними грошима;</li>
                    <li>оплата через платіжні термінали або інтернет-банкінг;</li>
                    <li>оплата на розрахунковий рахунок Виконавця через банк;</li>
                    <li>іншими способами за попереднім погодженням з Виконавцем.</li>
                  </ul>
                </li>
              </ol>
            </li>
            <li>
              <h2>УМОВИ НАДАННЯ ІНФОРМАЦІЙНОЇ ПОСЛУГИ</h2>
              <ol>
                <li>
                  Замовлення Інформаційної послуги Замовник здійснює через сайт, який містить інформацію про
                  інформаційно послугу.
                </li>
                <li>
                  Замовник після оплати Інформаційної автоматично стає користувачем Інформаційної послуги. Види і
                  способи оплати кожного виду Інформаційної послуги вказуються на Сайті.
                </li>
                <li>
                  Виконавець надає Замовнику Інформаційну послугу в форматі та/або в термін, який вказаний на Сайті.
                </li>
                <li>
                  Дана оферта має силу акта про надання послуг. Приймання проводиться без підписання відповідного
                  акта.
                </li>
                <li>
                  Виконавець залишає за собою право анулювати надання Інформаційної послуги Замовнику без повернення
                  внесеної оплати, в разі порушення ним правил. Зазначеними порушеннями є: розпалювання
                  міжнаціональних конфліктів, образа учасників Інформаційної послуги або спікера, відхилення від теми
                  Інформаційної послуги, реклама, нецензурні висловлювання і т.п.
                </li>
                <li>
                  Виконавець залишає за собою право анулювання надання Інформаційної послуги Замовнику без повернення
                  внесеної оплати в разі встановлення факту поширення Замовником інформації і матеріалів, отриманих
                  ним від Виконавця, третім особам за плату або безоплатно, без узгодження з Виконавцем. Використання
                  Замовником інформації і матеріалів, отриманих в результаті отримання Інформаційних послуг,
                  допускається тільки в особистих цілях і для особистого використання Замовника.
                </li>
              </ol>
            </li>
            <li>
              <h2>РЕЄСТРАЦІЯ ЗАМОВНИКА</h2>
              <ol>
                <li>
                  Надання Замовнику Інформаційної послуги можливо за умови заповнення їм на Сайті відповідної
                  реєстраційної форми.
                </li>
              </ol>
            </li>
            <li>
              <h2>ПРАВА ТА ОБОВ&apos;ЯЗКИ ВИКОНАВЦЯ</h2>
              <ol>
                <li>Виконавець зобов&apos;язується надавати Замовнику цілодобовий доступ до Сайту.</li>
                <li>
                  Виконавець несе відповідальність за зберігання і обробку персональних даних Замовника, забезпечує
                  конфіденційність цих даних в процесі їх обробки і використовує їх виключно для якісного надання
                  Інформаційної послуги Замовнику.
                </li>
                <li>
                  Виконавець залишає за собою право в будь-який момент змінювати місце і/або дату, і/або формат
                  надання Інформаційної послуги повідомивши Замовника не пізніше трьох календарних днів з моменту
                  прийняття такого рішення.
                </li>
                <li>
                  Виконавець має право змінювати тривалість Інформаційної послуги та/або умови цієї Оферти в
                  односторонньому порядку без попереднього повідомлення Замовника, публікуючи зазначені зміни на
                  Сайті, не пізніше 5 календарних днів з дня їх внесення (прийняття).
                </li>
                <li>
                  Виконавець має право продовжити терміни надання Інформаційної послуги, повідомивши про це Замовника
                  не пізніше трьох календарних днів з моменту прийняття такого рішення, на термін, що не перевищує 30
                  календарних днів.
                </li>
              </ol>
            </li>
            <li>
              <h2>ПРАВА ТА ОБОВ&apos;ЯЗКИ ЗАМОВНИКА</h2>
              <ol>
                <li>
                  Замовник зобов&apos;язаний надавати достовірну інформацію про себе в процесі заповнення
                  реєстраційної форми на Сайті. Замовник несе відповідальність за достовірність такої інформації.
                </li>
                <li>
                  Замовник зобов&apos;язується не відтворювати, не повторювати, не копіювати, не продавати, а також не
                  використовувати в яких би то не було цілях інформацію і матеріали, що стали йому доступними в
                  зв&apos;язку з наданням Інформаційної послуги, за винятком їх особистого використання або за згодою
                  Виконавця.
                </li>
                <li>Замовник користується всіма правами споживача відповідно до чинного законодавства України.</li>
                <li>
                  Замовник у разі надання йому послуги неналежної якості має право скористатися правами, передбаченими
                  ст. 8 Закону України «Про захист прав споживачів», виключно у випадках, коли порушення його прав
                  сталося з вини Виконавця і при доведеності зазначеної обставини.
                </li>
                <li>
                  Всі претензії щодо якості надання Інформаційної послуги повинні направлятися Замовником на адресу
                  Виконавця за допомогою листа на електронну пошту ivanka.tabachuk@gmail.com. Термін розгляду
                  претензії (ий) Замовника Виконавцем складає 30 (тридцять) днів (в тому числі претензій, що містять
                  вимогу про повернення грошових коштів) з моменту надходження претензії на адресу Виконавця, після
                  закінчення якого Виконавцем приймається одне з таких рішень: 1) про незгоду з претензією і про
                  відмову в поверненні коштів, або 2) про згоду з претензією і про задоволення вимоги про повернення
                  коштів.
                </li>
                <li>
                  Прийом до розгляду претензій Замовника з вимогою про повернення коштів припиняється за 7 (сім)
                  календарних днів до моменту початку надання Інформаційної послуги, що беззастережно приймається
                  сторонами.
                </li>
                <li>
                  У разі прийняття рішення Виконавцем про повернення грошових коштів, Грошові кошти повертаються
                  Замовнику шляхом їх: зарахування на рахунок Замовника в платіжних системах, кредитну карту,
                  особистий рахунок або інші реквізити узгоджені сторонами. Всі повернення грошових коштів
                  здійснюються за умови спрямування Замовником на адресу Виконавця заяви за формою, яке буде вислано
                  Замовнику листом по електронній пошті. Сторонами беззастережно приймається, що остаточне рішення про
                  спосіб повернення грошових коштів залишається в кожному конкретному випадку на розсуд Виконавця.
                </li>
                <li>
                  Грошові кошти зараховуються на рахунок в банку, зазначений Замовником, протягом 30-ти календарних
                  днів з моменту, коли Виконавець отримав заяви Замовника. Фінансовий документ, що підтверджує
                  внесення грошових коштів Виконавцем на рахунок Замовника, є доказом виконання Виконавцем
                  обов&apos;язків щодо повернення грошових коштів Замовнику, що беззастережно приймається сторонами.
                </li>
              </ol>
            </li>
            <li>
              <h2>ВІДПОВІДАЛЬНІСТЬ СТОРІН</h2>
              <ol>
                <li>
                  Виконавець і Замовник, беручи до уваги характер наданої послуги, зобов&apos;язуються в разі
                  виникнення суперечок і розбіжностей, пов&apos;язаних з наданням Інформаційної послуги, застосовувати
                  досудовий порядок врегулювання суперечки. У разі неможливості врегулювання суперечки в досудовому
                  порядку, сторони мають право звернутися до українського суду.
                </li>
                <li>
                  За невиконання або неналежне виконання зобов&apos;язань за цією Офертою, сторони несуть
                  відповідальність відповідно до законодавства України.
                </li>
              </ol>
            </li>
            <li>
              <h2>ГАРАНТІЇ ЯКОСТІ ІНФОРМАЦІЙНОЇ ПОСЛУГИ</h2>
              <ol>
                <li>
                  Замовник, приймаючи умови цієї Оферти, приймає на себе також ризик неотримання прибутку і ризик
                  можливих збитків, пов&apos;язаних з використанням знань, умінь і навичок, отриманих Замовником під
                  час надання Інформаційної послуги.
                </li>
                <li>
                  Гарантуючи успішність застосування отриманих знань, умінь і навичок, а також отримання Замовником
                  Інформаційної послуги певного прибутку (доходу) з їх використанням (реалізацією) у певному або
                  невизначеному майбутньому, Виконавець не несе відповідальності за неотримання прибутку (доходу),
                  отримання прибутку (доходу) нижче очікувань Замовника, а також за прямі і непрямі збитки Замовника,
                  оскільки успішність використання Замовником отриманих знань, умінь і навичок залежить від багатьох
                  відомих і невідомих Виконавцю факторів: цілеспрямованості, працьовитості, завзятості, рівня
                  інтелектуального розвитку, творчих здібностей Замовника, інших його індивідуальних якостей і
                  персональних характеристик, що приймається обома сторонами.
                </li>
              </ol>
            </li>
            <li>
              <h2>ФОРС-МАЖОР</h2>
              <ol>
                <li>
                  Сторони звільняються від відповідальності за часткове або повне невиконання зобов&apos;язань за цим
                  Договором, якщо це невиконання стало наслідком дії обставин непереборної сили (форс-мажорних
                  обставин), що виникли після укладення цього Договору та унеможливили виконання зобов&apos;язань
                  відповідно до умов цього Договору. До таких обставин зокрема, але не обмежуючись, відносяться
                  надзвичайні ситуації техногенного, природного або екологічного характеру, аварії в системах
                  електропостачання, руйнування цих систем, викликані, зокрема, землетрусами, повенями, ураганами і
                  т.д., тривала відсутність електроенергії та інтернету з незалежних від сторін причин, військові дії,
                  заколот, страйк, масові заворушення, безлади і інші протиправні дії, а також стан здоров&apos;я
                  Виконавця та / або іншого спікера публічної лекції, повінь, пожежа, антитерористичні операції,
                  землетрус і інші стихійні лиха, війна, військові дії, неконтрольовані, протиправні дії і акти
                  вандалізму третіх осіб, революційні дії, громадські заворушення, акти або дії органів державного
                  управління, прийняття законних або підзаконних актів, які прямо впливають на можливість виконання
                  сторонами умов цього договору, і будь-які інші надзвичайні обставини.
                </li>
                <li>
                  Термін виконання зобов&apos;язань за цим Договором відсувається на період часу, протягом якого діяли
                  ці обставини і їх наслідки.
                </li>
                <li>
                  Якщо форс-мажорні обставини та їх наслідки продовжують діяти більше шести місяців, сторони в
                  найкоротші терміни повинні провести переговори з метою виявлення прийнятних для обох Сторін
                  альтернативних способів виконання умов цього Договору та досягнення відповідних письмових
                  домовленостей.
                </li>
              </ol>
            </li>
            <li>
              <h2>ІНШІ ПОЛОЖЕННЯ</h2>
              <ol>
                <li>
                  Замовник гарантує, що всі умови оферти йому зрозумілі і він приймає їх безумовно і в повному обсязі,
                  без будь-яких умов, винятків і застережень.
                </li>
                <li>
                  У випадках, що не врегульовані цим Договором, Сторони зобов&apos;язуються керуватися нормами,
                  встановленими чинним законодавством України.
                </li>
                <li>
                  Виконавець за цим Договором є Табачук Іванна Вікторівна і/або особа, яка має право на надання таких
                  Інформаційних послуг.
                </li>
                <li>
                  Сторони дають один одному згоду на обробку та зберігання персональних даних, які стають відомими їм
                  у зв&apos;язку з укладенням цього Договору, в межах, в яких це необхідно відповідно до вимог чинного
                  законодавства України.
                </li>
              </ol>
            </li>
          </ol>
        </div>
      </div>
      <Footer />
    </div>
  );
}

